tutorials/incompressible/simpleSolver/turbineSiting/system/fvOptions
/*---------------------------------------------------------------------------*
Caelus 7.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

disk1
{
    type            actuationDiskSource;
    active          on;            //on/off switch
    selectionMode   cellSet;       //cellSet // points //cellZone
    cellSet         actuationDisk1;//cellSet name when selectionMode = cellSet

    actuationDiskSourceCoeffs
    {
        fieldNames  (U);
        diskDir     (1 0 0);   // orientation of the disk
        Cp          0.386;      // Cp
        Ct          0.58;       // Ct
        diskArea    40;         // disk area
        upstreamPoint (581849 4785810 1065);
    }
}

disk2
{
    type            actuationDiskSource;
    active          on;
    selectionMode   cellSet;
    cellSet         actuationDisk2;

    actuationDiskSourceCoeffs
    {
        fieldNames  (U);
        diskDir     (1 0 0);
        Cp          0.53;
        Ct          0.58;
        diskArea    40;
        upstreamPoint (581753 4785663 1070);
    }
}

// ************************************************************************* //
