tutorials/incompressible/simpleSolver/turbineSiting/system/fvSchemes
/*---------------------------------------------------------------------------*
Caelus 7.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default             steadyState;
}

gradSchemes
{
    default             Gauss linear;
}

divSchemes
{
    default             none;
    div(phi,U)          Gauss upwind;
    div((nuEff*dev(T(grad(U)))))    Gauss linear;
    div(phi,epsilon)    Gauss upwind;
    div(phi,k)          Gauss upwind;
}

laplacianSchemes
{
    default             Gauss linear limited 0.333;
}

interpolationSchemes
{
    default             linear;
}

snGradSchemes
{
    default             limited 0.333;
}

fluxRequired
{
    default             no;
    p;
}


// ************************************************************************* //
